define(function(require) {
	var Vue = require('Vue2');
	new Vue({
		el: '#checkRules',
		data: {
			checkRules: [{
				title: '案例一：假设目前还剩余5期，原计划每期还本金100，目前的剩余本金220，那么调整的情况为4种(早偿)',
				content: [{
					table: ['规则', '第一期偿还本金', '第二期偿还本金', '第三期偿还本金', '第四期偿还本金', '第五期偿还本金']
				}, {
					table: ['原计划', '100', '100', '100', '100', '100']
				}, {
					table: ['平摊', '44', '44', '44', '44', '44']
				}, {
					table: ['按计划规则一', '0', '0', '20', '100', '100']
				}, {
					table: ['按计划规则二', '100', '100', '20', '0', '0']
				}, {
					table: ['按计划规则三', '20', '100', '100', '0', '0']
				}, {
					table: ['按计划规则四', '0', '0', '100', '100', '20']
				}]
			}, {
				title: '案例二：假设目前还剩余5期，原计划每期还本金100，目前的剩余本金750，那么调整的情况为2种(逾期)',
				content: [{
					table: ['规则', '第一期偿还本金', '第二期偿还本金', '第三期偿还本金', '第四期偿还本金', '第五期偿还本金']
				}, {
					table: ['原计划', '100', '100', '100', '100', '100']
				}, {
					table: ['平摊', '150', '150', '150', '150', '150']
				}, {
					table: ['按计划规则一', '350', '100', '100', '100', '100']
				}, {
					table: ['按计划规则二', '100', '100', '100', '100', '350']
				}, {
					table: ['按计划规则三', '350', '100', '100', '100', '100']
				}, {
					table: ['按计划规则四', '100', '100', '100', '100', '350']
				}]
			}]
		}
	})
})